1s/ERP/extensions/liko/Enums/Лико_ВидыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ВидыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СложныйПовтор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПолныйПовтор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Security</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПовторСНовымОбъединением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПовторСИзменением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦифроваяПроба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПолныйповторСПеревыводом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пробник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Оснастка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Техобслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТестированиеМатериалов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/Enums/Лико_ТипыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Лико_ТипыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Термоусадка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пакеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СамоклеящаясяЭтикетка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Полуфабрикат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВплавляемаяЭтикетка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/extensions/liko/CommonModules/DFMКлиент/Ext/Module.bsl
&НаКлиенте
Процедура СоздатьНоменклатуруВерсию(Форма,СоздатьВерсию=Ложь,НайтиПродукт = Ложь )Экспорт 
	СоздатьНоменклатуруВерсиюАсинх(Форма,СоздатьВерсию, НайтиПродукт);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуруВерсию2(Форма,СоздатьВерсию=Ложь,НоменклатураНаименование)Экспорт 
	СоздатьНоменклатуруВерсиюАсинх2(Форма,СоздатьВерсию,НоменклатураНаименование);
КонецПроцедуры


&НаКлиенте
Асинх Процедура СоздатьНоменклатуруВерсиюАсинх2(Форма,СоздатьВерсию,НоменклатураНаименование)
	Объект=Форма.Объект;
	Тд=Форма.Элементы.Товары.ТекущиеДанные;
	Если Тд=Неопределено Тогда
		Сообщить("Не выбран продукт!");
	КонецЕсли;
	
	Если СоздатьВерсию И  Не Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Номенклатура,"Лико_DFM") Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Ждать ВопросАсинх(НСтр("ru = 'Необходимо создать номенклатуру и версию в DFM. Создать?'"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	Структура = Новый Структура;
	Если СоздатьВерсию И  Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Номенклатура,"Лико_DFM") Тогда
		Структура.Вставить("Номенклатура",Тд.Номенклатура);	
	КонецЕсли;
	
	Структура.Вставить("Клиент",Объект.Партнер);
	Структура.Вставить("НаименованиеНоменклатуры",НоменклатураНаименование);
	Структура.Вставить("Контрагент",Объект.Контрагент);
	Структура.Вставить("ТипЭтикетки",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Номенклатура,"Лико_ТипЭтикетки"));
	Структура.Вставить("Клиент",Объект.Партнер);
	Структура.Вставить("Менеджер",Объект.Менеджер);
	Структура.Вставить("Дизайнер",Объект.Дизайнер);
	Структура.Вставить("Регион",Объект.Регион);
	Структура.Вставить("ВерсияНоменклатуры",Тд.ВерсияНоменклатуры);
	Структура.Вставить("Заказ",Объект.ссылка);

	
	
	Структура.Вставить("Версия",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.ВерсияНоменклатуры,"Версия"));
	ВидРЦ=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.РабочийЦентр,"ВидРабочегоЦентра");
	Технология=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ВидРЦ,"лкТехнологияПечати");
	Структура.Вставить("Технология",Технология);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Форма",Форма);
	ОписаниеОповещение= Новый ОписаниеОповещения("СоздатьНоменклатуруDFMЗавершение",DFMКлиент,ПараметрыФормы);
	ОткрытьФорму("Справочник.Лико_ВерсииНоменклатуры.Форма.ФормаСозданияНоменклатуры",
	Структура,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры



&НаКлиенте
Асинх Процедура СоздатьНоменклатуруВерсиюАсинх300125(Форма,СоздатьВерсию, НайтиПродукт)
	Объект=Форма.Объект;
	Тд=Форма.Элементы.Товары.ТекущиеДанные;
	Если Тд=Неопределено Тогда
		Сообщить("Не выбран продукт!");
	КонецЕсли;
	
	Если СоздатьВерсию И  Не Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Номенклатура,"Лико_DFM") Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Ждать ВопросАсинх(НСтр("ru = 'Необходимо создать номенклатуру и версию в DFM. Создать?'"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	Структура = Новый Структура;
	Если СоздатьВерсию И  Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Номенклатура,"Лико_DFM") Тогда
		Структура.Вставить("Номенклатура",Тд.Номенклатура);	
	КонецЕсли;
	
	Структура.Вставить("Клиент",Объект.Партнер);
	Структура.Вставить("НаименованиеНоменклатуры",Строка(Тд.Номенклатура));
	Структура.Вставить("Контрагент",Объект.Контрагент);
	Структура.Вставить("ТипЭтикетки",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Номенклатура,"Лико_ТипЭтикетки"));
	Структура.Вставить("Клиент",Объект.Партнер);
	Структура.Вставить("Менеджер",Объект.Менеджер);
	Структура.Вставить("Дизайнер",Объект.Дизайнер);
	Структура.Вставить("Регион",Объект.Регион);
	Структура.Вставить("ВерсияНоменклатуры",Тд.ВерсияНоменклатуры);
	Структура.Вставить("Заказ",Объект.Ссылка);

	
	Структура.Вставить("Версия",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.ВерсияНоменклатуры,"Версия"));
	ВидРЦ=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.РабочийЦентр,"ВидРабочегоЦентра");
	Технология=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ВидРЦ,"лкТехнологияПечати");
	Структура.Вставить("Технология",Технология);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Форма",Форма);
	ОписаниеОповещение= Новый ОписаниеОповещения("СоздатьНоменклатуруDFMЗавершение",DFMКлиент,ПараметрыФормы);
	ОткрытьФорму("Справочник.Лико_ВерсииНоменклатуры.Форма.ФормаСозданияНоменклатуры",
	Структура,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СоздатьНоменклатуруВерсиюАсинх(Форма,СоздатьВерсию,НайтиПродукт)
	Объект=Форма.Объект;
	Тд=Форма.Элементы.Товары.ТекущиеДанные;
	Если  НайтиПродукт Тогда 
	Тд = Новый Структура;
	Тд.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	Тд.Вставить("ВерсияНоменклатуры",ПредопределенноеЗначение("Справочник.Лико_ВерсииНоменклатуры.ПустаяСсылка"));
	ИначеЕсли  Тд=Неопределено Тогда
		Сообщить("Не выбран продукт!");
	КонецЕсли;
	
	Если СоздатьВерсию И  Не Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Номенклатура,"Лико_DFM") Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Ответ = Ждать ВопросАсинх(НСтр("ru = 'Необходимо создать номенклатуру и версию в DFM. Создать?'"), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	Структура = Новый Структура;
	Если СоздатьВерсию И  Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Номенклатура,"Лико_DFM") Тогда
		Структура.Вставить("Номенклатура",Тд.Номенклатура);	
	КонецЕсли;
	
	Структура.Вставить("Клиент",Объект.Партнер);
	Структура.Вставить("НаименованиеНоменклатуры",Строка(Тд.Номенклатура));
	Структура.Вставить("Контрагент",Объект.Контрагент);
	Структура.Вставить("ТипЭтикетки",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Номенклатура,"Лико_ТипЭтикетки"));
	Структура.Вставить("Клиент",Объект.Партнер);
	Структура.Вставить("Менеджер",Объект.Менеджер);
	Структура.Вставить("Дизайнер",Объект.Дизайнер);
	Структура.Вставить("Регион",Объект.Регион);
	Структура.Вставить("ВерсияНоменклатуры",Тд.ВерсияНоменклатуры);
	Структура.Вставить("Заказ",Объект.Ссылка);
	Структура.Вставить("НайтиПродукт",НайтиПродукт);

	
	Структура.Вставить("Версия",Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.ВерсияНоменклатуры,"Версия"));
	ВидРЦ=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Объект.РабочийЦентр,"ВидРабочегоЦентра");
	Технология=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ВидРЦ,"лкТехнологияПечати");
	Структура.Вставить("Технология",Технология);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Форма",Форма);
	ОписаниеОповещение= Новый ОписаниеОповещения("СоздатьНоменклатуруDFMЗавершение",DFMКлиент,ПараметрыФормы);
	ОткрытьФорму("Справочник.Лико_ВерсииНоменклатуры.Форма.ФормаСозданияНоменклатуры",
	Структура,,,,,ОписаниеОповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры



&НаКлиенте
Процедура СоздатьНоменклатуруDFMЗавершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		Форма=Параметры.Форма;
		Элементы=Форма.Элементы;
		Тд                     =Элементы.Товары.ТекущиеДанные;
		Тд.ВерсияНоменклатуры  =Результат.ВерсияНоменклатуры;
		Тд.Номенклатура        =Результат.Номенклатура;
		Тд.Версия              =Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ВерсияНоменклатуры,"Версия");
		Форма.ТаблицаТоварыПриИзменении();
		Тд.Артикул             =Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Результат.ВерсияНоменклатуры,"Артикул");
		Тд.АртикулСтарый       =Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Тд.Номенклатура,"Лико_АртикулСтарый");


	    Форма.Модифицированность=Истина;
		
		УстановитьВидимость(Форма);
		
		//Элементы.Товары.Обновить();
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость(Форма,Группа="DFMGroupButtons") Экспорт //+Лико m.shenderov 14.06.2021
	Форма.Элементы.НоменклатураDFM.Видимость = Ложь;
	////КонецЕсли;
	
	Если Форма.ДатаНачалаСозданияНоменклатурыDFM  И Форма.Объект.НоменклатураDFM Тогда 
		Форма.Элементы[Группа].Видимость=Истина;
		Форма.Элементы.УведомитьДизайнераDFM2.Доступность=Ложь;
		
		Для каждого Товар Из Форма.Объект.Товары Цикл
			Если ЗначениеЗаполнено(Товар.ВерсияНоменклатуры) Тогда
				Форма.Элементы.УведомитьДизайнераDFM2.Доступность=Истина;
			КонецЕсли; 		
			
		КонецЦикла;
		
		Если Форма.Объект.Площадка<>ПредопределенноеЗначение("Справочник.Лико_Площадки.Линкс")
			И  Форма.Объект.ВидЗаказа=ПредопределенноеЗначение("Перечисление.Лико_ВидыЗаказов.ПолныйПовтор") ТОгда
			Форма.Элементы.СоздатьНоменклатуруDFM2.Доступность=Ложь;
			Форма.Элементы.СоздатьВерсиюDFM2.Доступность=Ложь; 		
			форма.Элементы.ТоварыАртикул.ТолькоПросмотр=Истина;
		
		КонецЕсли;
		
	Иначе
		Форма.Элементы[Группа].Видимость=Ложь;
	КонецЕсли;	
	
КонецПроцедуры //-Лико m.shenderov 14.06.2021

&НаКлиенте
Процедура УведомитьДизайнера(Форма) Экспорт  
	Массив = Новый Массив();
	Объект=Форма.Объект;
	
	НомерСтроки=0;
	Для Каждого Товар Из Объект.Товары Цикл
		
		Если ЗначениеЗаполнено( Товар.ВерсияНоменклатуры) ТОгда
			Структура = Новый Структура;
			Структура.Вставить("Номенклатура",Товар.Номенклатура);
			Структура.Вставить("ВерсияНоменклатуры",Товар.ВерсияНоменклатуры);
			Массив.Добавить(Структура);	
		КонецЕсли;	
	КонецЦикла;
	Если Массив.Количество()=0 Тогда
		ПоказатьПредупреждение(,"В заказе нет продукта с созданной версией. Создайте версию продукта!");
		Возврат;
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Форма",Форма);
	ОО  =Новый ОписаниеОповещения("УведомитьДизайнераЗавершение",DFMКлиент,ПараметрыФормы);
	Структура = Новый Структура;
	СТруктура.Вставить("Дизайнер",Объект.Дизайнер);
	Структура.Вставить("Товары",Массив);
	ОткрытьФорму("Справочник.Лико_ВерсииНоменклатуры.Форма.ФормаВопросаОтправкиУведомления",Структура,,,,,
	ОО,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 	
КонецПроцедуры

&НаКлиенте
Процедура УведомитьДизайнераЗавершение(Результат,Параметры)  Экспорт //+Лико m.shenderov 10.06.2021
	
	ЕСли  ТипЗнч(Результат)=Тип("Структура") И Результат.МассивВерсий.Количество()>0 Тогда
		
		DFMСервер.ОтправитьУведомлениеВDFMНаСервере(Результат.МассивВерсий,Результат.Дизайнер,Параметры.Форма.Объект.Ссылка,Результат.Комментарий);

				
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 10.06.2021

&НаКлиенте
Процедура ПередЗаписью(Форма,Отказ) Экспорт
	
	//Устарела
	//Возврат; 
	Для каждого Товар Из Форма.Объект.Товары Цикл
		
		Если ЗначениеЗаполнено(Товар.ВерсияНоменклатуры) Тогда
			
			Если  Не ЭтоВерсияНоменклатуры(Товар.ВерсияНоменклатуры,Товар.Номенклатура) Тогда
				
				Товар.ВерсияНоменклатуры=Неопределено;
				
			КонецЕсли;
			
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	НеСоответсвуетТехнологии=ВыполнитьПроверкуТехнологииПродукта(Форма);
	Если НеСоответсвуетТехнологии.Количество()>0  Тогда
		Отказ=Истина;
	ОписаниеОповещения = Новый ОписаниеОповещения("СоздатьВерсиюНоменклатурыАвтоЗавершение", DFMКлиент,Новый Структура("Форма",Форма));
	
	Структура = Новый Структура;
	Структура.Вставить("Технология",DFMСервер.ПолучитьТехнологиюПечати(ПолучитьСтруктуруЗаказа(Форма)));
	СТруктура.Вставить("Дизайнер",Форма.Объект.Дизайнер);
	Структура.Вставить("Товары",НеСоответсвуетТехнологии);
	ОткрытьФорму("Справочник.Лико_ВерсииНоменклатуры.Форма.ФормаВопросаИзмененияТехнологии",Структура,,,,,
	ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	КонецЕсли;	

КонецПроцедуры  

  
&НаКлиенте
Асинх Процедура СоздатьВерсиюНоменклатурыАвтоЗавершение(Результат, ДополнительныеПараметры) Экспорт
		
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		СоздатьВерсиюНоменклатурыДляТехнологииАвто(ДополнительныеПараметры.Форма,Результат);	

	КонецЕсли;
	
		
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьВерсиюНоменклатурыДляТехнологииАвто(Форма,Массив) Экспорт //+Лико m.shenderov 28.05.2021
        
	Если Не ПроверкаЗаполненияПолей(Форма) Тогда
		Возврат
	КонецЕсли;
		ТехнологияПечати=DFMСервер.ПолучитьТехнологиюПечати(ПолучитьСтруктуруЗаказа(Форма));

	
	     Для Каждого Товар Из Массив Цикл
			
			      Структура = Новый Структура;
				  Структура.Вставить("Товар",Товар);
				  Структура.Вставить("ТехнологияПечати",ТехнологияПечати);
				  Структура.Вставить("Регион",Форма.Объект.Регион);
				  Структура.Вставить("Партнер",Форма.Объект.Партнер);
                  Структура.Вставить("Менеджер",Форма.Объект.Менеджер);
				  Структура.Вставить("Заказ",Форма.Объект.Ссылка);
				   Структура.Вставить("Комментарий",Товар.Комментарий);

				  
				  
                  СтруктураНоменклатуры=DFMСервер.СоздатьНоменклатуру(Структура);
                                       
				
								
				  НайденныеСтроки = Форма.Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура",Товар.Номенклатура));
				  
				  Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл 					  
					  НайденнаяСтрока.Артикул =Лико_Дополнительно.ЗначениеРеквизитаОбъекта(СтруктураНоменклатуры.ВерсияНоменклатуры,"Артикул");
					  НайденнаяСтрока.Версия  =СтруктураНоменклатуры.Версия;
					  НайденнаяСтрока.ВерсияНоменклатуры=СтруктураНоменклатуры.ВерсияНоменклатуры;
					  НайденнаяСтрока.АртикулСтарый =Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Товар.Номенклатура,"Лико_АртикулСтарый");
				  КонецЦикла;

						
				
			КонецЦикла;
		Форма.Модифицированность=Истина;	
       УстановитьВидимость(Форма);

		
КонецПроцедуры //-Лико m.shenderov 28.05.2021

&НаКлиенте
Функция ПолучитьСтруктуруЗаказа(Форма) //+Лико m.shenderov 15.03.2022
	
	Структура=Новый Структура;
	Структура.Вставить("Площадка",Форма.Объект.Площадка);
	Структура.Вставить("РабочийЦентр",Форма.Объект.РабочийЦентр); 
	МассивВидПечати = Новый Массив(); 
	
	Для каждого Цвет Из Форма.Объект.Цвета Цикл 
		МассивВидПечати.Добавить(Цвет.ВидПечати);		
	КонецЦикла;
	
	Структура.Вставить("ВидыПечати",МассивВидПечати);  
	
	
	МассивРабочиеЦентры = Новый Массив(); 
	
	Для каждого ВидРабот Из Форма.Объект.ВидыРабот Цикл 
		МассивРабочиеЦентры.Добавить(ВидРабот.РабочийЦентр);
		
	КонецЦикла;
	
	Структура.Вставить("РабочиеЦентры",МассивРабочиеЦентры);
	
	Возврат Структура;	
	
КонецФункции  //-Лико m.shenderov 15.03.2022



&НаКлиенте
Функция ВыполнитьПроверкуТехнологииПродукта(Форма) Экспорт 
	РЦ     = Форма.Объект.РабочийЦентр;
	Отказ  = Ложь;
	Массив = Новый Массив();
	
	
	Форма.Объект.НоменклатураDFM=DFMСервер.ЭтоНоменклатураDFM(Форма.Объект.РабочийЦентр,Форма.Объект.ТипЗаказа,Форма.ДатаНачалаСозданияНоменклатурыDFM И Форма.Объект.Цвета.Количество()>0,Форма.Объект.ДатаПервойОтправкиВРаботу);
	ТехнологияПечати=DFMСервер.ПолучитьТехнологиюПечати(ПолучитьСтруктуруЗаказа(Форма));
	Если Форма.ДатаНачалаСозданияНоменклатурыDFM И Форма.Объект.НоменклатураDFM И ЗначениеЗаполнено(ТехнологияПечати)Тогда
		НомерСтроки=0;
		Для Каждого Товар Из Форма.Объект.Товары Цикл
			
			Если Не ЗначениеЗаполнено(Товар.ВерсияНоменклатуры) Тогда
				//Если Форма.Объект.ВидЗаказа=Перечисления.Лико_ВидыЗаказов.ПолныйПовтор Тогда
				//СтруктураНоменклатуры=Справочники.Лико_ВерсииНоменклатуры.СоздатьНоменклатуру(Товар.Номенклатура.Наименование,
				//Товар.Номенклатура.Лико_ТипЭтикетки,ТехнологияПечати,Неопределено,
				//Форма.Объект.Регион,Форма.Объект.Партнер,Форма.Объект.Менеджер,Форма.Объект.Дизайнер,Истина,Товар.Номенклатура);	
				//
				//Товар.Артикул=СтруктураНоменклатуры.ВерсияНоменклатуры.Артикул;
				//Товар.Версия=СтруктураНоменклатуры.Версия;
				//Товар.ВерсияНоменклатуры=СтруктураНоменклатуры.ВерсияНоменклатуры;
				
				
			//Иначе
				Структура = Новый Структура;
				Структура.Вставить("Номенклатура",Товар.Номенклатура);
				Структура.Вставить("ВерсияНоменклатуры",Товар.ВерсияНоменклатуры);
               Массив.Добавить(Структура); 
				
				Отказ=Истина;
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = СтрШаблон("Продукт: %1 не соответсвует технологии! Создатйте версиию продукта с технологией:%2.",Товар.Номенклатура,ТехнологияПечати);
				//Сообщение.Поле = "Объект.Товары["+НомерСтроки+"].Номенклатура"; //имя реквизита 
				//Сообщение.УстановитьДанные(Объект);
				//Сообщение.Сообщить();
			//КонецЕсли;
			
			КонецЕсли;
			НомерСтроки=НомерСтроки+1;	
		КонецЦикла;
		
			
	КонецЕсли;
Возврат Массив;
КонецФункции




&НаКлиенте
Функция ПроверкаЗаполненияПолей(Форма) Экспорт  //+Лико m.shenderov 28.04.2021
	Результат=Истина;
		СообщитьПользователю(Форма.Объект.Менеджер,"Форма.Объект.Менеджер","Менеджер",Результат);
        СообщитьПользователю(Форма.Объект.Партнер,"Форма.Объект.Партнер","Клиент",Результат); 
		//СообщитьПользователю(Объект.Дизайнер,"Объект.Дизайнер","Дизайнер",Результат); 

	Возврат Результат;	
КонецФункции //-Лико m.shenderov 28.04.2021 

&НаКлиенте
Процедура СообщитьПользователю(Поле,РеквизитПоля,Текст,Результат) Экспорт 
	Если Не ЗначениеЗаполнено(Поле) Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Не заполнен реквизит: %1",Текст);
		Сообщение.Поле = РеквизитПоля; //имя реквизита 
		
		Сообщение.Сообщить(); 		
		Результат=Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьНоменклатуру(Форма,ОставитьНоменклатуру) Экспорт
	
   _ВидРабочегоЦентра=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Форма.Объект.РабочийЦентр,"ВидРабочегоЦентра");
   
   Если _ВидРабочегоЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.GallusInkjet")	   
		//Или (ОставитьНоменклатуру И _ВидРабочегоЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Comexi"))
	    Или (ОставитьНоменклатуру И Форма.Объект.ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.ВплавляемаяЭтикетка"))
	    Или (ОставитьНоменклатуру И Форма.Объект.ТипЗаказа = ПредопределенноеЗначение("Перечисление.Лико_ТипыЗаказов.Термоусадка")) Тогда  
		
		Форма.Объект.НоменклатураDFM = Истина;
	Иначе
		Форма.Объект.НоменклатураDFM = Ложь;
	КонецЕсли;
	// <-- Конец Лико Яцун С. В. 24.11.2025
	Если НЕ Форма.Объект.НоменклатураDFM
		И Лико_Дополнительно.ЗначениеРеквизитаОбъекта(Форма.Объект.РабочийЦентр,"Лико_Площадка") = ПредопределенноеЗначение("Справочник.Лико_Площадки.Ликофлекс") 
		И (_ВидРабочегоЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MPSOfset")
		ИЛИ _ВидРабочегоЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.Drent")
		ИЛИ _ВидРабочегоЦентра = ПредопределенноеЗначение("Справочник.ВидыРабочихЦентров.MO3300"))
		Тогда
		ДатаПереходаНаDFMНовыхЗаказов = Лико_Дополнительно.ЗначениеРеквизитаОбъекта(ПредопределенноеЗначение("Справочник.Лико_ПредопределенныеЗначения.ДатаПереходаНаDFMНовыхЗаказов"),"ЗначениеПараметра");
		Если Форма.Объект.ДатаПервойОтправкиВРаботу = Дата(1,1,1) И ЗначениеЗаполнено(ДатаПереходаНаDFMНовыхЗаказов) ИЛИ ЗначениеЗаполнено(ДатаПереходаНаDFMНовыхЗаказов) И Форма.Объект.ДатаПервойОтправкиВРаботу > ДатаПереходаНаDFMНовыхЗаказов Тогда 
			Форма.Объект.НоменклатураDFM = Истина; 
		КонецЕсли;
	КонецЕсли;
	// <-- Начало Лико Яцун С. В. 24.11.2025
	
	Если Форма.Объект.НоменклатураDFM = Ложь Тогда
		Массив = Новый Массив(); 
		Для каждого Товар Из Форма.Объект.Товары Цикл
			 Массив.Добавить(Товар.Номенклатура);
		КонецЦикла;
		
		НоменклатураDFM = DFMСервер.ЭтоНоменклатураDFM(
		Форма.Объект.РабочийЦентр,
		Форма.Объект.ТипЗаказа,
		Форма.ДатаНачалаСозданияНоменклатурыDFM,
		Неопределено,
		Массив);	
		Если НоменклатураDFM Тогда
			
		Форма.Объект.НоменклатураDFM = Истина
		
		КонецЕсли;	
	КонецЕсли;
	

	
	Если Форма.Объект.НоменклатураDFM Тогда
		
		Форма.Элементы.ТоварыНоменклатура.ТолькоПросмотр = Истина;
		
		Если Не ОставитьНоменклатуру ТОгда
			Для каждого Товар Из Форма.Объект.Товары Цикл		
				Товар.Номенклатура = Неопределено;							
			КонецЦикла;
			Форма.ТаблицаТоварыПриИзменении();
		КонецЕсли;
	Иначе
		Форма.Элементы.ТоварыНоменклатура.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	УстановитьВидимость(Форма);
	
КонецПроцедуры

Функция ЭтоВерсияНоменклатуры(Версия,Номенклатура) Экспорт  //+Лико m.shenderov 28.02.2024
	
	Возврат  DFMСервер.ЭтоВерсияНоменклатуры(Версия,Номенклатура);
	
КонецФункции //-Лико 

&НаКлиенте
Процедура ОригиналМакет(Форма) Экспорт  //+--->Лико m.shenderov 10.12.2025
	текстр = Форма.Элементы.Товары.ТекущиеДанные;
	Если текстр<> Неопределено Тогда
		Форма.ВерсияНоменклатуры = текстр.ВерсияНоменклатуры;
		
		ВерсияНоменклатурыСтруктура=ВерсияНоменклатурыСтруктура(Форма.ВерсияНоменклатуры);	
	Иначе
		Форма.ВерсияНоменклатуры =Неопределено;
		
	КонецЕсли;
	
	
	
	Если Форма.ДатаНачалаСозданияНоменклатурыDFM И Форма.Объект.НоменклатураDFM Или Форма.ПоказатьDFM Тогда
		Если текстр= Неопределено
			Или Не ЗначениеЗаполнено(Форма.ВерсияНоменклатуры)
			ИЛи Не ВерсияНоменклатурыСтруктура.ФайлСогласования Тогда
			Форма.Элементы.ОригиналМакетDFM2.Доступность=Ложь;
			Форма.Элементы.ОригиналМакетDFM2.ЦветФона= Форма.Элементы.НайтиПродуктDFM2.ЦветФона;
		Иначе
			Форма.Элементы.ОригиналМакетDFM2.Доступность=Истина;
			Если ЗначениеЗаполнено(ВерсияНоменклатурыСтруктура.Согласовано) Тогда
				
				Форма.Элементы.ОригиналМакетDFM2.ЦветФона= Новый Цвет(200, 255, 200);
			Иначе
				//Форма.Элементы.ОригиналМакетDFM2.ЦветФона= Новый Цвет(255, 200, 200); 
				Форма.Элементы.ОригиналМакетDFM2.ЦветФона= WebЦвета.СветлоКоралловый; 

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры //-<---Лико m.shenderov 10.12.2025

&НаКлиенте
Процедура ПоказатьОригиналМакет(Форма) Экспорт
	ОригиналМакет(Форма);
	Если Форма.Элементы.ОригиналМакетDFM2.Доступность Тогда 
		
		ВерсияНоменклатурыСтруктура=ВерсияНоменклатурыСтруктура(Форма.ВерсияНоменклатуры);
		
		УРЛ = УРЛОригналМакет()+ВерсияНоменклатурыСтруктура.Артикул;
		
	ЗапуститьПриложение(УРЛ);
	
	КонецЕсли;

 КонецПроцедуры

Функция ВерсияНоменклатурыСтруктура(ВерсияНоменклатуры) //+Лико m.shenderov 09.12.2025

  Возврат DFMСервер.ВерсияНоменклатурыСтруктура(ВерсияНоменклатуры);  
	
КонецФункции  //-Лико m.shenderov 09.12.2025

&НаКлиенте
Функция УРЛОригналМакет() //+Лико m.shenderov 10.12.2025
Возврат "http://artworks.okil.ru/link/";

КонецФункции  //-Лико m.shenderov 10.12.2025
